In [38]:
import  pandas as pd
import numpy as np
ipl = pd.read_csv('../datasets/ipl-matches.csv')
ipl

,ID,City,Date,Season,MatchNumber,Team1,Team2,Venue,TossWinner,TossDecision,SuperOver,WinningTeam,WonBy,Margin,method,Player_of_Match,Team1Players,Team2Players,Umpire1,Umpire2
0,1312200,Ahmedabad,2022-05-29,2022,Final,Rajasthan Royals,Gujarat Titans,"Narendra Modi Stadium, Ahmedabad",Rajasthan Royals,bat,N,Gujarat Titans,Wickets,7.0,NaN,HH Pandya,"['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ...","['WP Saha', 'Shubman Gill', 'MS Wade', 'HH Pan...",CB Gaffaney,Nitin Menon
1,1312199,Ahmedabad,2022-05-27,2022,Qualifier 2,Royal Challengers Bangalore,Rajasthan Royals,"Narendra Modi Stadium, Ahmedabad",Rajasthan Royals,field,N,Rajasthan Royals,Wickets,7.0,NaN,JC Buttler,"['V Kohli', 'F du Plessis', 'RM Patidar', 'GJ ...","['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ...",CB Gaffaney,Nitin Menon
2,1312198,Kolkata,2022-05-25,2022,Eliminator,Royal Challengers Bangalore,Lucknow Super Giants,"Eden Gardens, Kolkata",Lucknow Super Giants,field,N,Royal Challengers Bangalore,Runs,14.0,NaN,RM Patidar,"['V Kohli', 'F du Plessis', 'RM Patidar', 'GJ ...","['Q de Kock', 'KL Rahul', 'M Vohra', 'DJ Hooda...",J Madanagopal,MA Gough
3,1312197,Kolkata,2022-05-24,2022,Qualifier 1,Rajasthan Royals,Gujarat Titans,"Eden Gardens, Kolkata",Gujarat Titans,field,N,Gujarat Titans,Wickets,7.0,NaN,DA Miller,"['YBK Jaiswal', 'JC Buttler', 'SV Samson', 'D ...","['WP Saha', 'Shubman Gill', 'MS Wade', 'HH Pan...",BNJ Oxenford,VK Sharma
4,1304116,Mumbai,2022-05-22,2022,70,Sunrisers Hyderabad,Punjab Kings,"Wankhede Stadium, Mumbai",Sunrisers Hyderabad,bat,N,Punjab Kings,Wickets,5.0,NaN,Harpreet Brar,"['PK Garg', 'Abhishek Sharma', 'RA Tripathi', ...","['JM Bairstow', 'S Dhawan', 'M Shahrukh Khan',...",AK Chaudhary,NA Patwardhan
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
945,335986,Kolkata,2008-04-20,2007/08,4,Kolkata Knight Riders,Deccan Chargers,Eden Gardens,Deccan Chargers,bat,N,Kolkata Knight Riders,Wickets,5.0,NaN,DJ Hussey,"['WP Saha', 'BB McCullum', 'RT Ponting', 'SC G...","['AC Gilchrist', 'Y Venugopal Rao', 'VVS Laxma...",BF Bowden,K Hariharan
946,335985,Mumbai,2008-04-20,2007/08,5,Mumbai Indians,Royal Challengers Bangalore,Wankhede Stadium,Mumbai Indians,bat,N,Royal Challengers Bangalore,Wickets,5.0,NaN,MV Boucher,"['L Ronchi', 'ST Jayasuriya', 'DJ Thornely', '...","['S Chanderpaul', 'R Dravid', 'LRPL Taylor', '...",SJ Davis,DJ Harper
947,335984,Delhi,2008-04-19,2007/08,3,Delhi Daredevils,Rajasthan Royals,Feroz Shah Kotla,Rajasthan Royals,bat,N,Delhi Daredevils,Wickets,9.0,NaN,MF Maharoof,"['G Gambhir', 'V Sehwag', 'S Dhawan', 'MK Tiwa...","['T Kohli', 'YK Pathan', 'SR Watson', 'M Kaif'...",Aleem Dar,GA Pratapkumar
948,335983,Chandigarh,2008-04-19,2007/08,2,Kings XI Punjab,Chennai Super Kings,"Punjab Cricket Association Stadium, Mohali",Chennai Super Kings,bat,N,Chennai Super Kings,Runs,33.0,NaN,MEK Hussey,"['K Goel', 'JR Hopes', 'KC Sangakkara', 'Yuvra...","['PA Patel', 'ML Hayden', 'MEK Hussey', 'MS Dh...",MR Benson,SL Shastri
949,335982,Bangalore,2008-04-18,2007/08,1,Royal Challengers Bangalore,Kolkata Knight Riders,M Chinnaswamy Stadium,Royal Challengers Bangalore,field,N,Kolkata Knight Riders,Runs,140.0,NaN,BB McCullum,"['R Dravid', 'W Jaffer', 'V Kohli', 'JH Kallis...","['SC Ganguly', 'BB McCullum', 'RT Ponting', 'D...",Asad Rauf,RE Koertzen

### Create a Pandas Series with values [1, 2, 2, 3, 3, 3, 4, 4, 4, 4] and find the count of each unique value.

In [39]:
s = pd.Series([1,2,2,3,3,3,4,4,4,4])
print(s)
s.unique()

0    1
1    2
2    2
3    3
4    3
5    3
6    4
7    4
8    4
9    4
dtype: int64

array([1, 2, 3, 4])

2. Load a CSV file into a Pandas DataFrame and sort it by a column named 'Margin' in descending order.

In [40]:
ipl['Margin'].sort_values(ascending=False)

329    146.0
388    144.0
949    140.0
453    138.0
597    130.0
       ...
608      NaN
621      NaN
708      NaN
819      NaN
883      NaN
Name: Margin, Length: 950, dtype: float64

3. Create a DataFrame with columns ['A', 'B', 'C'] and set column 'A' as the index.

In [41]:
temp_df =pd.DataFrame(columns=['A', 'B', 'C'])
temp_df.set_index('A', inplace=True)
temp_df

Empty DataFrame
Columns: [B, C]
Index: []

4. Rename the column 'marks' to 'score' in an existing DataFrame.

In [42]:
student_data = [
    [100,80,10],
    [90,70,7],
    [120,100,14],
    [80,50,2]
]
students = pd.DataFrame(student_data,columns=['Iq','Marks','Package'],dtype='int8')

In [43]:
students.rename(columns={'Marks':'Score'},inplace=True)

5. Reset the index of a DataFrame without keeping the old index.

In [44]:
students.set_index('Iq',inplace=True)
students.reset_index()

    Iq  Score  Package
0  100     80       10
1   90     70        7
2  120    100       14
3   80     50        2

6. Check which values in a DataFrame column 'age' are missing (NaN).

In [45]:
import pandas as pd
import numpy as np

# Creating a sample DataFrame
data = {
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Alice'],
    'age': [25, np.nan, 30, 35, np.nan],  # Contains missing values
    'salary': [50000, 60000, np.nan, 80000, 50000],  # Contains NaN
    'height': [165, 175, 180, 160, 165]  # In cm
}

df = pd.DataFrame(data)
print(df)

      name   age   salary  height
0    Alice  25.0  50000.0     165
1      Bob   NaN  60000.0     175
2  Charlie  30.0      NaN     180
3    David  35.0  80000.0     160
4    Alice   NaN  50000.0     165

In [46]:
df['age'].isnull().sum()

np.int64(2)

7. Fill all NaN values in a DataFrame column 'salary' with the mean salary.

In [47]:
df['salary'] = df['salary'].fillna(df['salary'].mean())

8. Remove duplicate rows from a DataFrame based on column 'name'.

In [48]:
df['name'].drop_duplicates()

0      Alice
1        Bob
2    Charlie
3      David
Name: name, dtype: object

8. Convert 'height' from cm to meters using **apply()**

In [49]:
df['height_m'] = df['height'].apply(lambda x: x / 100)
df

      name   age   salary  height  height_m
0    Alice  25.0  50000.0     165      1.65
1      Bob   NaN  60000.0     175      1.75
2  Charlie  30.0  60000.0     180      1.80
3    David  35.0  80000.0     160      1.60
4    Alice   NaN  50000.0     165      1.65

9. Insert a new column 'discount' at index 2 with a **10%** discount

In [50]:
df.insert(2, 'discount', 0.10)

In [51]:
df

      name   age  discount   salary  height  height_m
0    Alice  25.0       0.1  50000.0     165      1.65
1      Bob   NaN       0.1  60000.0     175      1.75
2  Charlie  30.0       0.1  60000.0     180      1.80
3    David  35.0       0.1  80000.0     160      1.60
4    Alice   NaN       0.1  50000.0     165      1.65